### Merging and Joining

In [2]:
# create two dataset
import pandas as pd

data1 = pd.DataFrame({
    'id': [1, 2, 3],
    'name': ['prakash', 'darshan', 'chutiya']
})

data2 = pd.DataFrame({
    'id': [1, 3, 4],
    'salary': [1000, 2000, 30000]
})
print(data1)
print(data2)

   id     name
0   1  prakash
1   2  darshan
2   3  chutiya
   id  salary
0   1    1000
1   3    2000
2   4   30000

joining two datas

In [ ]:
# outer
big_data1 = pd.merge(data1, data2, on='id', how="outer")
big_data1

   id     name   salary
0   1  prakash   1000.0
1   2  darshan      NaN
2   3  chutiya   2000.0
3   4      NaN  30000.0

In [6]:
# inner
big_data2 = pd.merge(data1, data2, on='id', how='inner')
big_data2

   id     name  salary
0   1  prakash    1000
1   3  chutiya    2000

In [ ]:
# left
big_data3 = pd.merge(data1, data2, on='id', how='left')
big_data3

   id     name  salary
0   1  prakash  1000.0
1   2  darshan     NaN
2   3  chutiya  2000.0

In [9]:
# right
big_data4 = pd.merge(data1, data2, on='id', how='right')
big_data4

   id     name  salary
0   1  prakash    1000
1   3  chutiya    2000
2   4      NaN   30000

In [8]:
# cross
# big_data5 = pd.merge(data1, data2, on='id', how='cross')
# big_data5

Concatinate

In [3]:
# vertical concatination (axis=0)
data1 = pd.DataFrame({
    'name': ['prakash', 'darshan'],
    'salary': [10000, 20000]
})
data2 = pd.DataFrame({
    'name': ['aakash', 'jhakas'],
    'salary': [13000, 17000]
})

df_concat = pd.concat([data1, data2], axis=0, ignore_index=True)
df_concat

      name  salary
0  prakash   10000
1  darshan   20000
2   aakash   13000
3   jhakas   17000

In [5]:
df_concat2 = pd.concat([data1, data2], axis=1, ignore_index=True)
df_concat2

         0      1       2      3
0  prakash  10000  aakash  13000
1  darshan  20000  jhakas  17000